//Задача 50. Напишите программу, которая на вход принимает позиции элемента в двумерном массиве,
//и возвращает значение этого элемента или же указание, что такого элемента нет.
//Например, задан массив:
//1 4 7 2
//5 9 2 3
//8 4 2 4
//17 -> такого числа в массиве нет
Console.WriteLine("Введите значение элемента массива!");
int elements = int.Parse(Console.ReadLine()!);
int [,] array = new int[5,5];
if (elements >= 10)
Console.WriteLine($"{elements} - такого числа в массиве нет!");

void GetArray(int[,] array)
{
    for(int i = 0; i < array.GetLength(0); i++)
    {
        for(int j = 0; j < array.GetLength(1); j++)
        {
            array[i, j] = new Random().Next(1,10);
        }
    }    
}

void FullArray (int[,] matr)
{
    for(int i = 0; i < matr.GetLength(0); i++)
    {
        for(int j = 0; j < matr.GetLength(1); j++)
        {
            Console.Write($"{matr[i,j]} ");
        }
    Console.WriteLine();
    }
}

void GetArrayElements(int[,] array)
{
    for(int i = 0; i < array.GetLength(0); i++)
    {
        for(int j = 0; j < array.GetLength(1); j++)
        {
            if (elements == array[i,j])
            Console.Write($"{elements} ");
        }    
    }            
}
GetArray(array);
FullArray(array);
Console.WriteLine();
GetArrayElements(array);